<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.0/6.0 MB 55.1 MB/s eta 0:00:0000:0100:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp37-cp37m-linux_x86_64.whl size=1159122 sha256=55fa936241d31252978238e1846677292710199d302568f73fb3f87f810a0411
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/ef/95/ac/c232f83b415900c26553c64266e1a2b2863bc63e7a5d606c7e
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.24
    Uninstalling SQLAlchemy-1.3.24:
      Successfully uninstalled SQLAlchemy-1.3.24
Successfully installed sqlalchemy-1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [10]:
!pip install -q pandas==1.1.5

In [11]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [71]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")
%sql select * from SPACEXTBL where dayname(DATE)='Friday' limit 2

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such function: dayname
[SQL: select * from SPACEXTBL where dayname(DATE)='Friday' limit 2]
(Background on this error at: http://sqlalche.me/e/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [61]:
%sql select distinct launch_site from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [18]:
%sql select launch_site, Payload from SPACEXTBL where launch_site like 'CCA%' limit 5

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40', 'Dragon Spacecraft Qualification Unit'),
 ('CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese'),
 ('CCAFS LC-40', 'Dragon demo flight C2'),
 ('CCAFS LC-40', 'SpaceX CRS-1'),
 ('CCAFS LC-40', 'SpaceX CRS-2')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [32]:
%sql select sum(PAYLOAD_MASS__KG_) from SPACEXTBL where Customer='NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [62]:
%sql select avg(PAYLOAD_MASS__KG_) from SPACEXTBL where booster_version='F9 v1.1'

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [35]:
%sql select min("Date") from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('01-03-2013',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [38]:
%sql select Booster_Version, Customer, PAYLOAD_MASS__KG_ from SPACEXTBL where PAYLOAD_MASS__KG_>4000 and PAYLOAD_MASS__KG_<6000

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 'AsiaSat', 4535),
 ('F9 v1.1 B1011', 'AsiaSat', 4428),
 ('F9 v1.1 B1014', 'ABS Eutelsat', 4159),
 ('F9 v1.1 B1016', 'Turkmenistan National Space Agency', 4707),
 ('F9 FT B1020', 'SES', 5271),
 ('F9 FT B1022', 'SKY Perfect JSAT Group', 4696),
 ('F9 FT B1026', 'SKY Perfect JSAT Group', 4600),
 ('F9 FT B1030', 'EchoStar', 5600),
 ('F9 FT  B1021.2', 'SES', 5300),
 ('F9 FT B1032.1', 'NRO', 5300),
 ('F9 B4 B1040.1', 'U.S. Air Force', 4990),
 ('F9 FT  B1031.2', 'SES EchoStar', 5200),
 ('F9 B4 B1043.1', 'Northrop Grumman', 5000),
 ('F9 FT  B1032.2', 'SES', 4230),
 ('F9 B4  B1040.2', 'SES', 5384),
 ('F9 B5 B1046.2', 'Telkom Indonesia', 5800),
 ('F9 B5 B1047.2', 'Es hailSat', 5300),
 ('F9 B5B1054', 'USAF', 4400),
 ('F9 B5 B1048.3', 'PSN, SpaceIL / IAI', 4850),
 ('F9 B5 B1051.2 ', 'Canadian Space Agency (CSA)', 4200),
 ('F9 B5B1060.1', 'U.S. Space Force', 4311),
 ('F9 B5 B1058.2 ', 'Republic of Korea Army, Spaceflight Industries (BlackSky)', 5500),
 ('F9 B5B1062.1', 'USSF', 4311)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [45]:
%sql select count(Mission_Outcome) as successful from SPACEXTBL where Mission_Outcome like "%Success%"
%sql select count(Mission_Outcome) as failure from SPACEXTBL where Mission_Outcome like "%failure%"

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.

[(1,)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [47]:
%sql select booster_version, PAYLOAD_MASS__KG_ from SPACEXTBL where PAYLOAD_MASS__KG_=(select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [66]:
%sql select substr(Date,4,2) as month, "Landing _Outcome", booster_version, launch_site from SPACEXTBL where "Landing _Outcome" like "%failure%" and Date like "%2015%"

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [67]:
%sql select "Landing _Outcome", Date from SPACEXTBL where Date>"04-06-2010" and Date<"20-03-2017" order by substr(Date,7,4)

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)', '08-12-2010'),
 ('No attempt', '08-10-2012'),
 ('No attempt', '06-01-2014'),
 ('Controlled (ocean)', '18-04-2014'),
 ('Controlled (ocean)', '14-07-2014'),
 ('No attempt', '05-08-2014'),
 ('No attempt', '07-09-2014'),
 ('Failure (drone ship)', '10-01-2015'),
 ('Controlled (ocean)', '11-02-2015'),
 ('Failure (drone ship)', '14-04-2015'),
 ('Failure (drone ship)', '17-01-2016'),
 ('Success (drone ship)', '08-04-2016'),
 ('Success (drone ship)', '06-05-2016'),
 ('Failure (drone ship)', '15-06-2016'),
 ('Success (ground pad)', '18-07-2016'),
 ('Success (drone ship)', '14-08-2016'),
 ('Success (drone ship)', '14-01-2017'),
 ('Success (ground pad)', '19-02-2017'),
 ('No attempt', '16-03-2017'),
 ('No attempt', '15-05-2017'),
 ('No attempt', '05-07-2017'),
 ('Success (ground pad)', '14-08-2017'),
 ('Success (ground pad)', '07-09-2017'),
 ('Success (drone ship)', '09-10-2017'),
 ('Success (drone ship)', '11-10-2017'),
 ('Success (ground pad)', '15-12-2017'),
 ('Success (ground pad)', '08-01-2018'),
 ('No attempt', '06-03-2018'),
 ('Success (drone ship)', '18-04-2018'),
 ('Success (drone ship)', '11-05-2018'),
 ('No attempt', '04-06-2018'),
 ('Success', '07-08-2018'),
 ('Success', '10-09-2018'),
 ('Success', '08-10-2018'),
 ('Success', '15-11-2018'),
 ('Failure', '05-12-2018'),
 ('Success', '11-01-2019'),
 ('Success', '12-06-2019'),
 ('No attempt ', '06-08-2019'),
 ('Success', '11-11-2019'),
 ('Success', '05-12-2019'),
 ('Success', '17-12-2019'),
 ('Success', '07-01-2020'),
 ('No attempt', '19-01-2020'),
 ('Failure', '17-02-2020'),
 ('Success', '07-03-2020'),
 ('Failure', '18-03-2020'),
 ('Success', '04-06-2020'),
 ('Success', '13-06-2020'),
 ('Success', '07-08-2020'),
 ('Success', '18-08-2020'),
 ('Success', '06-10-2020'),
 ('Success', '18-10-2020'),
 ('Success', '05-11-2020'),
 ('Success', '16-11-2020'),
 ('Success', '06-12-2020')]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>